#pragma once

#ifndef __NUMBERS_H__
#define __NUMBERS_H__

#include <stdlib.h> 

/*ќсновы и окончани€ числительных*/

/*ќт нул€ до дев€ти*/
char ToTenNames[10][7] = { "ноль","один","два","три",
"четыре", "п€ть", "шесть", "семь", "восемь", "дев€ть" };

/*ќт одиннадцати до дев€тнадцати*/
char ToTwentyNames[10][14] = {"дес€ть",  "одиннадцать", "двенадцать",
"тринадцать", "четырнадцать", "п€тнадцать", "шестнадцать",
"семнадцать", "восемнадцать", "дев€тнадцать" };

/*∆енский род дл€ сочетаний с тыс€чами*/
char OneTwoThousand[3][5] = { "", "одна", "две"};

/*ƒес€тки*/
char DecadesNames[10][12] = { "", "дес€ть","двадцать",
"тридцать", "сорок", "п€тьдес€т", "шестьдес€т",
"семьдес€т", "восемьдес€т", "дев€носто" };

/*—отни*/
char HandredsNames[10][10] = { "", "сто", 
"двести", "триста", "четыреста", "п€тьсот", 
"шестьсот", "семьсот", "восемьсот", "дев€тьсот" };

/*ќсновы чисел с пор€дком кратным трем (вида 10^3n)*/
char MillesNames[12][12] = { "", "тыс€ч", "миллион",
"миллиард", "триллион", "квадриллион", "квинтиллион", "секстиллион",
"септиллион", "октиллион", "нониллион", "дециллион" };

/*ќкончани€ дл€ чисел с пор€дком кратным трем */
char MillesFlexions[3][3] = { "", "а", "ов" };

/*ќкончани€ дл€ тыс€ч*/
char ThousandFlexions[3][2] = { "а", "и", "" };

/*ќкончани€ дл€ дес€тых и сотых долей и прилагательного целый*/
char ToHandredFractionsFlexions[3][3] = { "а€", "ые", "ых" };

/*ќкончани€ дл€ долей от тыс€чных и выше*/
char FractionsFlexions[3][4] = { "на€", "ные", "ных" };

char FractionsNames[3][7] = {"", "дес€ти", "ста" };

char ToHandredFractionsNames[3][6] = { "", "дес€т", "сот" };

char Quot[] = "цел"; /*ќснова прилагательного целый*/

#endif /*__NUMBERS_H__*/